# Дан список чисел, необходимо для каждого элемента посчитать сумму его соседей,
# для крайних чисел одним из соседей является число с противоположной стороны списка
lst = [12, 54, -65,  32, 83, 75, -1, -4, -666, 23, 56, -111]
length = len(lst)
lst_sum = [lst[i - 1] + lst[i + 1 if i + 1 < length else 0] for i in range(length)]

print(lst_sum)
