# Дан список рандомных чисел, необходимо отсортировать его в виде, сначала четные, потом нечётные
lst = [2, 6, 7, 11, -21, -6, 434, 666, -800, -33, 222, 1000, -1001]

print(sorted(lst, key=lambda x: x % 2))
